app/controllers/school_classes_controller.rb

    def edit
        @school_class = find_school_class(params[:id])
        @school_class.title = params[:title]
        @school_class.room_number = params[:room_number]
        @school_class.save
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["updated_at", "2021-06-13 23:21:10.815675"], ["id", 1]]

    def find_school_class(id)
        school = SchoolClass.find(id)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]